# MeganewtonMeters Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..MeganewtonMeters Property
UnitTypeId Class See Also
---
Meganewton meters.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId MeganewtonMeters { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MeganewtonMeters As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MeganewtonMeters {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace